work/depot/app/controllers/products_controller.rb

  def index
    # if params[:page]
      @products = Product.order(:title).page(params[:page]).per(2)
---
SELECT  "products".* FROM "products" ORDER BY title LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"