work/depot/app/controllers/store_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."title" ASC
SELECT COUNT(*) AS "size", MAX("products"."updated_at") AS timestamp FROM "products"
---
  def index
    if params[:set_locale]
      redirect_to store_index_url(locale: params[:set_locale])
    else
      @products = Product.order(:title).page(params[:page]).per(3)