work/depot/app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "david@mailer.com"], ["encrypted_password", "$2a$11$SKVHzBnWxSqfeR.Mqu7RHewEbXxpxhjfyOhjQDH7dJX8UPdtUzNVi"], ["updated_at", "2020-05-07 08:12:20.239849"], ["id", 3]]